app/controllers/authentications_controller.rb

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'facebook' AND `authentications`.`uid` = '534430388' LIMIT 1
INSERT INTO `authentications` (`created_at`, `provider`, `token`, `uid`, `updated_at`, `user_id`) VALUES ('2012-10-06 07:09:24', 'facebook', 'AAABk9se8Ch4BAMxysulprTpY3ZCdhlZAeCiC3M99QxAogUZBDadqZAxXr2p9XOTNh70A3iIzGZBbZAXoZBfdBiJXAmGIlbdZAjLFtcblpYtZAZCgZDZD', '534430388', '2012-10-06 07:09:24', 1)
INSERT INTO `users` (`college_id`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `dob`, `email`, `encrypted_password`, `first_name`, `gender`, `last_name`, `last_sign_in_at`, `last_sign_in_ip`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`) VALUES (NULL, '2012-10-23 05:43:15', NULL, NULL, NULL, 'adam.bedford@live.com', '', 'Adam', NULL, 'Bedford', NULL, NULL, NULL, NULL, NULL, 0, '2012-10-23 05:43:15')
---
  def create
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.authentications.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])